GopalSaraf/Practicals/PSDL/include/proc/pic18f14k22lin.inc
// Register: PORTC
#define PORTC PORTC
PORTC                                    equ 0F82h
// bitfield definitions
PORTC_NOT_LINRESET_POSN                  equ 0007h
PORTC_NOT_LINRESET_POSITION              equ 0007h
PORTC_NOT_LINRESET_SIZE                  equ 0001h
PORTC_NOT_LINRESET_LENGTH                equ 0001h
PORTC_NOT_LINRESET_MASK                  equ 0080h
PORTC_RC0_POSN                           equ 0000h
PORTC_RC0_POSITION                       equ 0000h
PORTC_RC0_SIZE                           equ 0001h
PORTC_RC0_LENGTH                         equ 0001h
PORTC_RC0_MASK                           equ 0001h
PORTC_RC1_POSN                           equ 0001h
PORTC_RC1_POSITION                       equ 0001h
PORTC_RC1_SIZE                           equ 0001h
PORTC_RC1_LENGTH                         equ 0001h
PORTC_RC1_MASK                           equ 0002h
PORTC_RC2_POSN                           equ 0002h
PORTC_RC2_POSITION                       equ 0002h
PORTC_RC2_SIZE                           equ 0001h
PORTC_RC2_LENGTH                         equ 0001h
PORTC_RC2_MASK                           equ 0004h
PORTC_RC3_POSN                           equ 0003h
PORTC_RC3_POSITION                       equ 0003h
PORTC_RC3_SIZE                           equ 0001h
PORTC_RC3_LENGTH                         equ 0001h
PORTC_RC3_MASK                           equ 0008h
PORTC_RC4_POSN                           equ 0004h
PORTC_RC4_POSITION                       equ 0004h
PORTC_RC4_SIZE                           equ 0001h
PORTC_RC4_LENGTH                         equ 0001h
PORTC_RC4_MASK                           equ 0010h
PORTC_RC5_POSN                           equ 0005h
PORTC_RC5_POSITION                       equ 0005h
PORTC_RC5_SIZE                           equ 0001h
PORTC_RC5_LENGTH                         equ 0001h
PORTC_RC5_MASK                           equ 0020h
PORTC_nLINRESET_POSN                     equ 0007h
PORTC_nLINRESET_POSITION                 equ 0007h
PORTC_nLINRESET_SIZE                     equ 0001h
PORTC_nLINRESET_LENGTH                   equ 0001h
PORTC_nLINRESET_MASK                     equ 0080h
PORTC_AN4_POSN                           equ 0000h
PORTC_AN4_POSITION                       equ 0000h
PORTC_AN4_SIZE                           equ 0001h
PORTC_AN4_LENGTH                         equ 0001h
PORTC_AN4_MASK                           equ 0001h
PORTC_AN5_POSN                           equ 0001h
PORTC_AN5_POSITION                       equ 0001h
PORTC_AN5_SIZE                           equ 0001h
PORTC_AN5_LENGTH                         equ 0001h
PORTC_AN5_MASK                           equ 0002h
PORTC_AN6_POSN                           equ 0002h
PORTC_AN6_POSITION                       equ 0002h
PORTC_AN6_SIZE                           equ 0001h
PORTC_AN6_LENGTH                         equ 0001h
PORTC_AN6_MASK                           equ 0004h
PORTC_AN7_POSN                           equ 0003h
PORTC_AN7_POSITION                       equ 0003h
PORTC_AN7_SIZE                           equ 0001h
PORTC_AN7_LENGTH                         equ 0001h
PORTC_AN7_MASK                           equ 0008h
PORTC_RC6_POSN                           equ 0006h
PORTC_RC6_POSITION                       equ 0006h
PORTC_RC6_SIZE                           equ 0001h
PORTC_RC6_LENGTH                         equ 0001h
PORTC_RC6_MASK                           equ 0040h
PORTC_RC7_POSN                           equ 0007h
PORTC_RC7_POSITION                       equ 0007h
PORTC_RC7_SIZE                           equ 0001h
PORTC_RC7_LENGTH                         equ 0001h
PORTC_RC7_MASK                           equ 0080h
PORTC_C12INP_POSN                        equ 0000h
PORTC_C12INP_POSITION                    equ 0000h
PORTC_C12INP_SIZE                        equ 0001h
PORTC_C12INP_LENGTH                      equ 0001h
PORTC_C12INP_MASK                        equ 0001h
PORTC_C12IN1M_POSN                       equ 0001h
PORTC_C12IN1M_POSITION                   equ 0001h
PORTC_C12IN1M_SIZE                       equ 0001h
PORTC_C12IN1M_LENGTH                     equ 0001h
PORTC_C12IN1M_MASK                       equ 0002h
PORTC_C12IN2M_POSN                       equ 0002h
PORTC_C12IN2M_POSITION                   equ 0002h
PORTC_C12IN2M_SIZE                       equ 0001h
PORTC_C12IN2M_LENGTH                     equ 0001h
PORTC_C12IN2M_MASK                       equ 0004h
PORTC_C12IN3M_POSN                       equ 0003h
PORTC_C12IN3M_POSITION                   equ 0003h
PORTC_C12IN3M_SIZE                       equ 0001h
PORTC_C12IN3M_LENGTH                     equ 0001h
PORTC_C12IN3M_MASK                       equ 0008h
PORTC_C12OUT_POSN                        equ 0004h
PORTC_C12OUT_POSITION                    equ 0004h
PORTC_C12OUT_SIZE                        equ 0001h
PORTC_C12OUT_LENGTH                      equ 0001h
PORTC_C12OUT_MASK                        equ 0010h
PORTC_LINRESET_POSN                      equ 0007h
PORTC_LINRESET_POSITION                  equ 0007h
PORTC_LINRESET_SIZE                      equ 0001h
PORTC_LINRESET_LENGTH                    equ 0001h
PORTC_LINRESET_MASK                      equ 0080h
PORTC_P1D_POSN                           equ 0002h
PORTC_P1D_POSITION                       equ 0002h
PORTC_P1D_SIZE                           equ 0001h
PORTC_P1D_LENGTH                         equ 0001h
PORTC_P1D_MASK                           equ 0004h
PORTC_P1C_POSN                           equ 0003h
PORTC_P1C_POSITION                       equ 0003h
PORTC_P1C_SIZE                           equ 0001h
PORTC_P1C_LENGTH                         equ 0001h
PORTC_P1C_MASK                           equ 0008h
PORTC_P1B_POSN                           equ 0004h
PORTC_P1B_POSITION                       equ 0004h
PORTC_P1B_SIZE                           equ 0001h
PORTC_P1B_LENGTH                         equ 0001h
PORTC_P1B_MASK                           equ 0010h
PORTC_P1A_POSN                           equ 0005h
PORTC_P1A_POSITION                       equ 0005h
PORTC_P1A_SIZE                           equ 0001h
PORTC_P1A_LENGTH                         equ 0001h
PORTC_P1A_MASK                           equ 0020h
PORTC_C2INP_POSN                         equ 0000h
PORTC_C2INP_POSITION                     equ 0000h
PORTC_C2INP_SIZE                         equ 0001h
PORTC_C2INP_LENGTH                       equ 0001h
PORTC_C2INP_MASK                         equ 0001h
PORTC_PGM_POSN                           equ 0003h
PORTC_PGM_POSITION                       equ 0003h
PORTC_PGM_SIZE                           equ 0001h
PORTC_PGM_LENGTH                         equ 0001h
PORTC_PGM_MASK                           equ 0008h
PORTC_C2OUT_POSN                         equ 0004h
PORTC_C2OUT_POSITION                     equ 0004h
PORTC_C2OUT_SIZE                         equ 0001h
PORTC_C2OUT_LENGTH                       equ 0001h
PORTC_C2OUT_MASK                         equ 0010h
PORTC_CCP1_POSN                          equ 0005h
PORTC_CCP1_POSITION                      equ 0005h
PORTC_CCP1_SIZE                          equ 0001h
PORTC_CCP1_LENGTH                        equ 0001h
PORTC_CCP1_MASK                          equ 0020h
PORTC_CCP2_POSN                          equ 0001h
PORTC_CCP2_POSITION                      equ 0001h
PORTC_CCP2_SIZE                          equ 0001h
PORTC_CCP2_LENGTH                        equ 0001h
PORTC_CCP2_MASK                          equ 0002h
PORTC_PA1_POSN                           equ 0002h
PORTC_PA1_POSITION                       equ 0002h
PORTC_PA1_SIZE                           equ 0001h
PORTC_PA1_LENGTH                         equ 0001h
PORTC_PA1_MASK                           equ 0004h
PORTC_PA2_POSN                           equ 0001h
PORTC_PA2_POSITION                       equ 0001h
PORTC_PA2_SIZE                           equ 0001h
PORTC_PA2_LENGTH                         equ 0001h
PORTC_PA2_MASK                           equ 0002h

